{
  "Header": {
    "home": "Home",
    "aboutMe": "About me",
    "projects": "Projects",
    "contact": "Contact",
    "english": "English",
    "polish": "Polish"
  },
  "Title":{
    "excerpt":"Hi, I'm a self-taught, passionate React Front-end Developer based in Koszalin, Poland 🌊"
  },
  "AboutMe": {
    "aboutMe":"ABOUT ME",
    "excerpt": "A passionate React Front-end developer",
    "description": "Hi, I'm Patryk, a self-taught React Front-end developer with a strong passion for creating exceptional user experiences. What started as a hobby has evolved into a dedicated pursuit of knowledge, as I continuously challenge myself to learn and grow. I thrive on the opportunity to work on projects that push me beyond my comfort zone, enabling me to expand my skill set and stay at the forefront of industry trends. With expertise in HTML5, CSS3, Sass, Typescript, React.js, and GraphQL, I am well-equipped to build visually appealing and interactive websites. My focus is not only on aesthetics but also on ensuring a smooth and responsive experience for users across different devices. I believe in the power of user-centric design and strive to create intuitive interfaces that enhance usability."
  },
  "Projects" : {
    "title": "Projects",
    "description": "Every project is a unique piece of development 💻",
    "technologies": "Technologies used:",
    "demo": "Live Demo",
    "code": "Code",
    "tomRys": {
      "title":"Tom-Rys",
      "description": "Tom-Rys is my first commercial project done for a local plumber. It was written in Vanilla JS, CSS3, and HTML, without using any additional libraries to avoid potential additional costs for the client in the future."
    },
    "tropicar": {
      "title": "Tropicar",
      "description": "Tropicar is an exotic car rental service which lets you book your dream car for any duration. Car offers are fetched from the AirTable Base using the AirTable API. Website lets you gain more info about any of the car, check the price lists of each one of them and also lets you book it via the built-in booking form that auto-calculates how much you have to pay and validates if all inputs are valid."
    },
    "onely" : {
      "title": "Onely Blog Clone",
      "description": "Onely blog is a clone site of onely.com/blog that was made for exercise purpose only. It is connected to GraphQL CMS and uses rich text rendered to display formatted blog posts. Website lets you display all posts that can be searched via categories or authors. There is a page that displays all authors who are a part of the team, from where you can access each author's profile page which includes a short Q&A and display all posts written by the chosen author. The blog has been written using React.js and then rewrote to Angular for practice purposes. Angular version can be found on my github"
    },
    "countryData": {
      "title" :"Country Data",
      "description": "Country data is my first React.js project that is pretty straight-forward. It uses axios to fetch data from the world data API, then iterates all of the countries that were fetched, handles any errors and missing information, then renders every country, each in a separate block. There is also a simple search function and a bar chart generated using given data and ChartJS library."
    }
  },
  "ContactMe" : {
    "title": "CONTACT ME",
    "excerpt": "Together, let's embark on new and exciting projects, where I can bring my dedication, enthusiasm, and passion for front-end development to create impactful digital experiences."
  }
}