{
  "Header": {
    "home": "Strona g贸wna",
    "aboutMe": "O mnie",
    "projects": "Projekty",
    "contact": "Kontakt",
    "english": "Angielski",
    "polish": "Polski"
  },
  "Title":{
    "excerpt":"Cze, jestem React Front-end developerem z zamiowania, mieszkajcym w Koszalinie "
  },
  "AboutMe": {
    "aboutMe": "O MNIE",
    "excerpt": "React Front-end developer z zamiowania",
    "description": "Cze, jestem Patryk, samouk w dziedzinie tworzenia stron internetowych z u偶yciem React. Mam silne zamiowanie do tworzenia wyjtkowych dowiadcze u偶ytkownika. To, co zaczo si od hobby, przerodzio si w nieustanne d偶enie do zdobywania wiedzy, gdy偶 stale stawiam sobie wyzwania i rozwijam si. Czerpi rado z pracy nad projektami, kt贸re wykraczaj poza moj stref komfortu, co pozwala mi poszerza umiejtnoci i by na bie偶co z trendami bran偶owymi. Dziki dowiadczeniu w HTML5, CSS3, Sass, Typescript, React.js i GraphQL, jestem wietnie przygotowany do tworzenia atrakcyjnych wizualnie i interaktywnych stron internetowych. Skupiam si nie tylko na estetyce, ale r贸wnie偶 na zapewnieniu pynnego i responsywnego dowiadczenia dla u偶ytkownik贸w na r贸偶nych urzdzeniach. Wierz w potg projektowania skoncentrowanego na u偶ytkowniku i staram si tworzy intuicyjne interfejsy, kt贸re zwikszaj u偶yteczno."
  },
  "Projects" : {
    "title": "Projekty",
    "description": "Ka偶dy projekt to unikatowy proces tw贸rczy ",
    "technologies": "U偶yte technologie:",
    "demo": "Demo",
    "code": "Kod",
    "tomRys": {
      "title": "Tom-Rys",
      "description": "Tom-Rys to m贸j pierwszy projekt komercyjny wykonany dla lokalnego hydraulika. Zosta napisany w Vanilla JS, CSS3 i HTML, bez u偶ycia 偶adnych dodatkowych bibliotek aby nie narazi klienta na potencjalne dodatkowe koszta w przyszoci."
    },
    "tropicar": {
      "title": "Tropicar",
      "description": "Tropicar to usuga wynajmu egzotycznych samochod贸w, kt贸ra umo偶liwia rezerwacj wymarzonego auta na dowolny okres. Oferty samochod贸w s pobierane z bazy AirTable za pomoc API AirTable. Strona internetowa umo偶liwia uzyskanie dodatkowych informacji o dowolnym z samochod贸w, sprawdzenie listy cen ka偶dego z nich oraz rezerwacj za pomoc wbudowanego formularza, kt贸ry automatycznie oblicza kwot do zapaty i sprawdza poprawno wprowadzonych danych.      "
    },
    "onely" : {
      "title": "Klon bloga Onely",
      "description": "Klon bloga onely.com/blog stworzona tylko w celach wiczeniowych. Jest poczona z GraphQL CMS i u偶ywa rich text do wywietlania sformatowanych post贸w na blogu. Strona umo偶liwia wywietlanie wszystkich post贸w, kt贸re mo偶na przeszukiwa za pomoc kategorii lub autor贸w. Istnieje r贸wnie偶 strona, na kt贸rej wywietleni s wszyscy autorzy nale偶cy do zespou, z kt贸rej mo偶na przej do profilu ka偶dego autora, kt贸ry zawiera kr贸tkie pytania i odpowiedzi oraz wywietla wszystkie posty napisane przez wybranego autora. Blog zostawi napisy w React.js a potem przepisany w Angularze w celach wiczeniowych. Wersj angularow mo偶na znale藕 na moim profilu Github."
    },
    "countryData": {
      "title": "Dane o krajach",
      "description": "Dane o krajach to m贸j pierwszy projekt w React.js, kt贸ry jest do prosty. Wykorzystuje bibliotek axios do pobierania danych z API dotyczcego wiatowych danych. Nastpnie iteruje przez wszystkie pobrane kraje, obsuguje ewentualne bdy i brakujce informacje, a nastpnie renderuje ka偶dy kraj w osobnym bloku. Istnieje r贸wnie偶 prost funkcj wyszukiwania oraz wykres supkowy generowany na podstawie dostarczonych danych przy u偶yciu biblioteki ChartJS."
    }
  },
  "ContactMe" : {
    "title": "SKONTAKTUJ SI ZE MN",
    "excerpt": "Wyruszmy razem na nowe i ekscytujce projekty, gdzie mog wykorzysta moje oddanie, entuzjazm i pasj do front-end developmentu, aby tworzy wpywowe dowiadczenia cyfrowe."
  }
}